{
  "_class_name": "AutoencoderKL",
  "_diffusers_version": "0.4.2",
  "act_fn": "silu",
  "block_out_channels": [
    128,
    256,
    512,
    512
  ],
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "in_channels": 3,
  "latent_channels": 4,
  "layers_per_block": 2,
  "norm_num_groups": 32,
  "out_channels": 3,
  "sample_size": 256,
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ],
  "global_batch_size": 8,
  "global_seed": 0,
  "model": "DiffMa-L/2",
  "epochs": 50,
  "dt_rank": 16,
  "d_state": 16,
  "vae": "ema",
  "image_size": 224,
  "results_dir": "/home/xumx/Diffussion",
  "init_from_pretrain_ckpt": false
}
